DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x40U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_DISP_B1_00 (coord E13), ENET_RGMII_RX_EN */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_RX_EN_PERIPHERAL                         LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_RX_EN_SIGNAL                         lcdif_clk   /*!< Signal name */

/* GPIO_DISP_B1_04 (coord E10), ENET_RGMII_RXD2 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_RXD2_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_RXD2_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_RXD2_CHANNEL                                0U   /*!< Signal channel */

/* GPIO_DISP_B1_05 (coord C11), ENET_RGMII_RXD3 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_RXD3_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_RXD3_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_RXD3_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord D10), ENET_RGMII_TXD3 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TXD3_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TXD3_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TXD3_CHANNEL                                2U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord E12), ENET_RGMII_TXD2 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TXD2_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TXD2_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TXD2_CHANNEL                                3U   /*!< Signal channel */

/* GPIO_DISP_B1_08 (coord A15), ENET_RGMII_TXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TXD1_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TXD1_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TXD1_CHANNEL                                4U   /*!< Signal channel */

/* GPIO_DISP_B1_09 (coord C13), ENET_RGMII_TXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TXD0_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TXD0_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TXD0_CHANNEL                                5U   /*!< Signal channel */

/* GPIO_DISP_B1_10 (coord B14), ENET_RGMII_TX_EN */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TX_EN_PERIPHERAL                         LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TX_EN_SIGNAL                        lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TX_EN_CHANNEL                               6U   /*!< Signal channel */

/* GPIO_DISP_B1_11 (coord A14), ENET_RGMII_TXC */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_TXC_PERIPHERAL                           LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_TXC_SIGNAL                          lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_TXC_CHANNEL                                 7U   /*!< Signal channel */

/* GPIO_DISP_B2_02 (coord E9), ENET_TXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD0_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD0_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD0_CHANNEL                                     10U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord D7), ENET_TXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD1_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD1_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD1_CHANNEL                                     11U   /*!< Signal channel */

/* GPIO_DISP_B2_04 (coord C7), ENET_TXEN */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXEN_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXEN_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXEN_CHANNEL                                     12U   /*!< Signal channel */

/* GPIO_DISP_B2_05 (coord C9), ENET_TX_REF_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TX_REF_CLK_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TX_REF_CLK_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TX_REF_CLK_CHANNEL                               13U   /*!< Signal channel */

