DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* GPIO_DISP_B2_06 (coord C6), ENET_RXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD0_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD0_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD0_CHANNEL                                     14U   /*!< Signal channel */

/* GPIO_DISP_B2_07 (coord D6), ENET_RXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD1_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD1_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD1_CHANNEL                                     15U   /*!< Signal channel */

/* GPIO_DISP_B2_08 (coord B5), ENET_CRS_DV */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_CRS_DV_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_CRS_DV_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_CRS_DV_CHANNEL                                   16U   /*!< Signal channel */

/* GPIO_DISP_B2_09 (coord D8), ENET_RXER */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXER_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXER_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXER_CHANNEL                                     17U   /*!< Signal channel */

/* GPIO_DISP_B2_10 (coord D9), BT_UART_TXD */
/* Routed pin properties */
#define BOARD_INITPINS_BT_UART_TXD_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_BT_UART_TXD_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_BT_UART_TXD_CHANNEL                                   18U   /*!< Signal channel */

/* GPIO_DISP_B2_11 (coord A6), BT_UART_RXD */
/* Routed pin properties */
#define BOARD_INITPINS_BT_UART_RXD_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_BT_UART_RXD_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_BT_UART_RXD_CHANNEL                                   19U   /*!< Signal channel */

/* GPIO_DISP_B2_12 (coord B6), GPIO_DISP_B2_12 */
/* Routed pin properties */
#define BOARD_INITPINS_GPIO_DISP_B2_12_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_GPIO_DISP_B2_12_SIGNAL                         lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_GPIO_DISP_B2_12_CHANNEL                               20U   /*!< Signal channel */

/* GPIO_DISP_B2_13 (coord A5), BT_UART_RTS */
/* Routed pin properties */
#define BOARD_INITPINS_BT_UART_RTS_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_BT_UART_RTS_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_BT_UART_RTS_CHANNEL                                   21U   /*!< Signal channel */

/* GPIO_DISP_B1_02 (coord D11), ENET_RGMII_RXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_RXD0_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_RXD0_SIGNAL                        lcdif_hsync   /*!< Signal name */

/* GPIO_DISP_B1_03 (coord E11), ENET_RGMII_RXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_RXD1_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_RXD1_SIGNAL                        lcdif_vsync   /*!< Signal name */

/* GPIO_AD_20 (coord K13), SAI1_RXD[0]/J9[7]/J50[20]/J61[1]/BT_PCM_RXD/U16[10]/U355[18] */
/* Routed pin properties */
#define BOARD_INITPINS_en_5v_PERIPHERAL                                    GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_en_5v_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_en_5v_CHANNEL                                         19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_en_5v_GPIO                                          GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_en_5v_GPIO_PIN                                        19U   /*!< GPIO pin number */
#define BOARD_INITPINS_en_5v_GPIO_PIN_MASK                           (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_AD_16 (coord N17), SPDIF_OUT/WIFI_RST_B/U354[3] */
/* Routed pin properties */
#define BOARD_INITPINS_bklt_PERIPHERAL                                     GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_bklt_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_bklt_CHANNEL                                          15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_bklt_GPIO                                           GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_bklt_GPIO_PIN                                         15U   /*!< GPIO pin number */
#define BOARD_INITPINS_bklt_GPIO_PIN_MASK                            (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_15 (coord M14), SPDIF_IN/U43[4]/BT_RST#/U16[14]/J54[54] */
/* Routed pin properties */
#define BOARD_INITPINS_tft_3v3_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_tft_3v3_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_tft_3v3_CHANNEL                                       14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_tft_3v3_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_tft_3v3_GPIO_PIN                                      14U   /*!< GPIO pin number */
#define BOARD_INITPINS_tft_3v3_GPIO_PIN_MASK                         (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_AD_04 (coord M13), SIM1_PD/J44[C8]/USER_LED_CTL1/J9[8]/J25[7] */
/* Routed pin properties */
#define BOARD_INITPINS_batt_sw_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_batt_sw_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_batt_sw_CHANNEL                                        3U   /*!< Signal channel */

