DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_batt_sw_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_batt_sw_GPIO_PIN                                       3U   /*!< GPIO pin number */
#define BOARD_INITPINS_batt_sw_GPIO_PIN_MASK                          (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_AD_28 (coord L17), LPSPI1_SCK/U27[6]/BT_DEV_WAKE/U354[9]/U16[39]/J10[12] */
/* Routed pin properties */
#define BOARD_INITPINS_batt_en_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_batt_en_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_batt_en_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_batt_en_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_batt_en_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define BOARD_INITPINS_batt_en_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_AD_02 (coord R13), SIM1_RST/J57[5]/J44[C2]/LCD_RST_B/J48[21]/J25[11]/J10[6] */
/* Routed pin properties */
#define BOARD_INITPINS_tft_xres_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_tft_xres_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_tft_xres_CHANNEL                                       1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_tft_xres_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_tft_xres_GPIO_PIN                                      1U   /*!< GPIO pin number */
#define BOARD_INITPINS_tft_xres_GPIO_PIN_MASK                         (1U << 1U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_01 (coord D13), ENET_RGMII_RXC/U10[27] */
/* Routed pin properties */
#define BOARD_INITPINS_tft_csb_PERIPHERAL                                 GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_tft_csb_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_tft_csb_CHANNEL                                       22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_tft_csb_GPIO                                       GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_tft_csb_GPIO_PIN                                      22U   /*!< GPIO pin number */
#define BOARD_INITPINS_tft_csb_GPIO_PIN_MASK                         (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_AD_14 (coord N14), SPDIF_EXT_CLK/CAN_STBY/J9[16] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN_STB_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_CAN_STB_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN_STB_CHANNEL                                       13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN_STB_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN_STB_GPIO_PIN                                      13U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN_STB_GPIO_PIN_MASK                         (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_LPSR_00 (coord N6), CAN3_TX */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_TX_PERIPHERAL                                   CAN3   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_LPSR_01 (coord R6), CAN3_RX */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_RX_PERIPHERAL                                   CAN3   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_AD_19 (coord L16), SAI1_RX_BCLK/J9[1]/J50[18]/U32[12] */
/* Routed pin properties */
#define BOARD_INITPINS_ABS_PERIPHERAL                                      GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_ABS_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ABS_CHANNEL                                           18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ABS_GPIO                                            GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ABS_GPIO_PIN                                          18U   /*!< GPIO pin number */
#define BOARD_INITPINS_ABS_GPIO_PIN_MASK                             (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_AD_11 (coord P16), USB_OTG1_OC/U26[A2]/J26[4] */
/* Routed pin properties */
#define BOARD_INITPINS_AI_SBATTFUEL_MON_MCU_IN_PERIPHERAL                 LPADC1   /*!< Peripheral name */
#define BOARD_INITPINS_AI_SBATTFUEL_MON_MCU_IN_SIGNAL                          B   /*!< Signal name */
#define BOARD_INITPINS_AI_SBATTFUEL_MON_MCU_IN_CHANNEL                        1U   /*!< Signal channel */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_PERIPHERAL                   GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_CHANNEL                        30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_GPIO                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_GPIO_PIN                       30U   /*!< GPIO pin number */
#define BOARD_INITPINS_FUEL_SBATT_CTRL_MCUOUT_GPIO_PIN_MASK          (1U << 30U)   /*!< GPIO pin mask */

/* GPIO_AD_09 (coord R16), USB_OTG1_ID/U28[3]/U26[A1]/J26[10]/J20[4] */
/* Routed pin properties */
#define BOARD_INITPINS_AI_FUEL_MCU_IN_PERIPHERAL                          LPADC1   /*!< Peripheral name */
#define BOARD_INITPINS_AI_FUEL_MCU_IN_SIGNAL                                   B   /*!< Signal name */
#define BOARD_INITPINS_AI_FUEL_MCU_IN_CHANNEL                                 1U   /*!< Signal channel */

