DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* GPIO_AD_10 (coord R17), USB_OTG1_PWR/J26[2]/U26[A1] */
/* Routed pin properties */
#define BOARD_INITPINS_SBAT_PERIPHERAL                                    LPADC1   /*!< Peripheral name */
#define BOARD_INITPINS_SBAT_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITPINS_SBAT_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITPINS_DO_BATT_MON_EN_PERIPHERAL                           GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_DO_BATT_MON_EN_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DO_BATT_MON_EN_CHANNEL                                29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DO_BATT_MON_EN_GPIO                                 GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DO_BATT_MON_EN_GPIO_PIN                               29U   /*!< GPIO pin number */
#define BOARD_INITPINS_DO_BATT_MON_EN_GPIO_PIN_MASK                  (1U << 29U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_02 (coord C15), LOW_OIL */
/* Routed pin properties */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_PERIPHERAL              GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_SIGNAL                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_CHANNEL                     5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_GPIO                    GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_GPIO_PIN                    5U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_LOW_OIL_PRESSURE_MCU_IN_GPIO_PIN_MASK       (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_LPSR_04 (coord N7), I2C5_SDA/J48[26]/U32[18]/U34[6]/J10[18] */
/* Routed pin properties */
#define BOARD_INITPINS_EEPROM_I2C_SDA_PERIPHERAL                          LPI2C5   /*!< Peripheral name */
#define BOARD_INITPINS_EEPROM_I2C_SDA_SIGNAL                                 SDA   /*!< Signal name */

/* GPIO_LPSR_05 (coord N8), I2C5_SCL/J48[27]/U32[17]/U34[4]/J10[20] */
/* Routed pin properties */
#define BOARD_INITPINS_EEPROM_I2C_SCL_PERIPHERAL                          LPI2C5   /*!< Peripheral name */
#define BOARD_INITPINS_EEPROM_I2C_SCL_SIGNAL                                 SCL   /*!< Signal name */

/* WAKEUP (coord T8), DI_IGN_MCU_IN */
/* Routed pin properties */
#define BOARD_INITPINS_DI_IGN_MCU_IN_PERIPHERAL                           GPIO13   /*!< Peripheral name */
#define BOARD_INITPINS_DI_IGN_MCU_IN_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_IGN_MCU_IN_CHANNEL                                  0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_IGN_MCU_IN_GPIO                                 GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_IGN_MCU_IN_GPIO_PIN                                 0U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_IGN_MCU_IN_GPIO_PIN_MASK                    (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_03 (coord B17), SD1_D1/J15[8]/WIFI_SDIO_D1/J54[15] */
/* Routed pin properties */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_PERIPHERAL              GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_SIGNAL                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_CHANNEL                     6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_GPIO                    GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_GPIO_PIN                    6U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_SET_MCU_IN_GPIO_PIN_MASK       (1U << 6U)   /*!< GPIO pin mask */

/* DCDC_PSWITCH (coord P3), MCU_DCDC_IN/VDD_3V3 */
/* Routed pin properties */
#define BOARD_INITPINS_DCDC_PSWITCH_PERIPHERAL                            SUPPLY   /*!< Peripheral name */
#define BOARD_INITPINS_DCDC_PSWITCH_SIGNAL                          dcdc_pswitch   /*!< Signal name */

/* GPIO_EMC_B1_14 (coord B1), SEMC_A5 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A5_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A5_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A5_CHANNEL                                       14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A5_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A5_GPIO_PIN                                      14U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A5_GPIO_PIN_MASK                         (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_15 (coord C1), SEMC_A6 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A6_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A6_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A6_CHANNEL                                       15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A6_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A6_GPIO_PIN                                      15U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A6_GPIO_PIN_MASK                         (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_32 (coord D1), SEMC_D10 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D10_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D10_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D10_CHANNEL                                       0U   /*!< Signal channel */

