DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D10_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D10_GPIO_PIN                                      0U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D10_GPIO_PIN_MASK                         (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_34 (coord E1), SEMC_D12 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D12_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D12_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D12_CHANNEL                                       2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D12_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D12_GPIO_PIN                                      2U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D12_GPIO_PIN_MASK                         (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_35 (coord F1), SEMC_D13 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D13_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D13_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D13_CHANNEL                                       3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D13_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D13_GPIO_PIN                                      3U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D13_GPIO_PIN_MASK                         (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_36 (coord G1), SEMC_D14 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D14_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D14_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D14_CHANNEL                                       4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D14_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D14_GPIO_PIN                                      4U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D14_GPIO_PIN_MASK                         (1U << 4U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_37 (coord H1), SEMC_D15/U13[53] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D15_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D15_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D15_CHANNEL                                       5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D15_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D15_GPIO_PIN                                      5U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D15_GPIO_PIN_MASK                         (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_38 (coord J1), SEMC_DM1 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM1_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM1_CHANNEL                                       6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DM1_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM1_GPIO_PIN                                      6U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DM1_GPIO_PIN_MASK                         (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_40 (coord K1), SEMC_RDY */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_RDY_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_RDY_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_RDY_CHANNEL                                       8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_RDY_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_RDY_GPIO_PIN                                      8U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_RDY_GPIO_PIN_MASK                         (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_41 (coord L1), SEMC_CSX0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CSX0_PERIPHERAL                                GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CSX0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CSX0_CHANNEL                                      9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_CSX0_GPIO                                      GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_CSX0_GPIO_PIN                                     9U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_CSX0_GPIO_PIN_MASK                        (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_04 (coord M1), SEMC_D20 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D20_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D20_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D20_CHANNEL                                      14U   /*!< Signal channel */

