DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D20_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D20_GPIO_PIN                                     14U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D20_GPIO_PIN_MASK                        (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_05 (coord N1), SEMC_D21 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D21_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D21_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D21_CHANNEL                                      15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D21_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D21_GPIO_PIN                                     15U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D21_GPIO_PIN_MASK                        (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_08 (coord P1), SEMC_DM2 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM2_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM2_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM2_CHANNEL                                      18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DM2_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM2_GPIO_PIN                                     18U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DM2_GPIO_PIN_MASK                        (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_03 (coord R1), SEMC_D19 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D19_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D19_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D19_CHANNEL                                      13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D19_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D19_GPIO_PIN                                     13U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D19_GPIO_PIN_MASK                        (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_06 (coord T1), SEMC_D22 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D22_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D22_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D22_CHANNEL                                      16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D22_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D22_GPIO_PIN                                     16U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D22_GPIO_PIN_MASK                        (1U << 16U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_10 (coord A2), SEMC_A1 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A1_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A1_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A1_CHANNEL                                       10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A1_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A1_GPIO_PIN                                      10U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A1_GPIO_PIN_MASK                         (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_23 (coord B2), SEMC_A10 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A10_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A10_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A10_CHANNEL                                      23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A10_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A10_GPIO_PIN                                     23U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A10_GPIO_PIN_MASK                        (1U << 23U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_11 (coord C2), SEMC_A2 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A2_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A2_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A2_CHANNEL                                       11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A2_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A2_GPIO_PIN                                      11U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A2_GPIO_PIN_MASK                         (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_31 (coord D2), SEMC_D9 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D9_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D9_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D9_CHANNEL                                       31U   /*!< Signal channel */

