DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D9_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D9_GPIO_PIN                                      31U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D9_GPIO_PIN_MASK                         (1U << 31U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_33 (coord E2), SEMC_D11 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D11_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D11_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D11_CHANNEL                                       1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D11_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D11_GPIO_PIN                                      1U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D11_GPIO_PIN_MASK                         (1U << 1U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_01 (coord F2), SEMC_D1 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D1_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D1_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D1_CHANNEL                                        1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D1_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D1_GPIO_PIN                                       1U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D1_GPIO_PIN_MASK                          (1U << 1U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_21 (coord G2), SEMC_BA0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_BA0_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_BA0_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_BA0_CHANNEL                                      21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_BA0_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_BA0_GPIO_PIN                                     21U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_BA0_GPIO_PIN_MASK                        (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_22 (coord H2), SEMC_BA1 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_BA1_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_BA1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_BA1_CHANNEL                                      22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_BA1_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_BA1_GPIO_PIN                                     22U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_BA1_GPIO_PIN_MASK                        (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_39 (coord J2), SEMC_DQS */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DQS_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DQS_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DQS_CHANNEL                                       7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DQS_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DQS_GPIO_PIN                                      7U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DQS_GPIO_PIN_MASK                         (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_00 (coord K2), SEMC_D16 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D16_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D16_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D16_CHANNEL                                      10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D16_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D16_GPIO_PIN                                     10U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D16_GPIO_PIN_MASK                        (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_15 (coord L2), SEMC_D30 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D30_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D30_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D30_CHANNEL                                      25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D30_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D30_GPIO_PIN                                     25U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D30_GPIO_PIN_MASK                        (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_12 (coord M2), SEMC_D27 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D27_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D27_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D27_CHANNEL                                      22U   /*!< Signal channel */

