DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D27_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D27_GPIO_PIN                                     22U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D27_GPIO_PIN_MASK                        (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_09 (coord N2), SEMC_D24 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D24_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D24_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D24_CHANNEL                                      19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D24_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D24_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D24_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_16 (coord P2), SEMC_D21 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D31_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D31_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D31_CHANNEL                                      26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D31_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D31_GPIO_PIN                                     26U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D31_GPIO_PIN_MASK                        (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_10 (coord R2), SEMC_D25 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D25_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D25_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D25_CHANNEL                                      20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D25_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D25_GPIO_PIN                                     20U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D25_GPIO_PIN_MASK                        (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_17 (coord T2), SEMC_DM3 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM3_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM3_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM3_CHANNEL                                      27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DM3_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM3_GPIO_PIN                                     27U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DM3_GPIO_PIN_MASK                        (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_09 (coord A3), SEMC_A0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A0_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A0_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A0_CHANNEL                                        9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A0_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A0_GPIO_PIN                                       9U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A0_GPIO_PIN_MASK                          (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_17 (coord B3), SEMC_A8 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A8_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A8_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A8_CHANNEL                                       17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A8_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A8_GPIO_PIN                                      17U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A8_GPIO_PIN_MASK                         (1U << 17U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_20 (coord C3), SEMC_A12 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A12_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A12_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A12_CHANNEL                                      20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A12_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A12_GPIO_PIN                                     20U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A12_GPIO_PIN_MASK                        (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_16 (coord D3), SEMC_A7 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A7_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A7_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A7_CHANNEL                                       16U   /*!< Signal channel */

