DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A7_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A7_GPIO_PIN                                      16U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A7_GPIO_PIN_MASK                         (1U << 16U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_30 (coord E3), SEMC_D8 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D8_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D8_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D8_CHANNEL                                       30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D8_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D8_GPIO_PIN                                      30U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D8_GPIO_PIN_MASK                         (1U << 30U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_00 (coord F3), SEMC_D0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D0_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D0_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D0_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D0_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D0_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D0_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_07 (coord H3), SEMC_D7 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D7_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D7_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D7_CHANNEL                                        7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D7_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D7_GPIO_PIN                                       7U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D7_GPIO_PIN_MASK                          (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_26 (coord J3), SEMC_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CLK_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CLK_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CLK_CHANNEL                                      26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_CLK_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_CLK_GPIO_PIN                                     26U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_CLK_GPIO_PIN_MASK                        (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_02 (coord K3), SEMC_D18 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D18_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D18_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D18_CHANNEL                                      12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D18_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D18_GPIO_PIN                                     12U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D18_GPIO_PIN_MASK                        (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_07 (coord M3), SEMC_D23 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D23_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D23_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D23_CHANNEL                                      17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D23_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D23_GPIO_PIN                                     17U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D23_GPIO_PIN_MASK                        (1U << 17U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_18 (coord N3), SEMC_DQS4 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DQS4_PERIPHERAL                                GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DQS4_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DQS4_CHANNEL                                     28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DQS4_GPIO                                      GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DQS4_GPIO_PIN                                    28U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DQS4_GPIO_PIN_MASK                       (1U << 28U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_18 (coord B4), SEMC_A9 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A9_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A9_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A9_CHANNEL                                       18U   /*!< Signal channel */

