DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A9_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A9_GPIO_PIN                                      18U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A9_GPIO_PIN_MASK                         (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_19 (coord C4), SEMC_A11 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A11_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A11_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A11_CHANNEL                                      19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A11_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A11_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A11_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_03 (coord E4), SEMC_D3 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D3_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D3_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D3_CHANNEL                                        3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D3_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D3_GPIO_PIN                                       3U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D3_GPIO_PIN_MASK                          (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_05 (coord F4), SEMC_D5 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D5_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D5_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D5_CHANNEL                                        5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D5_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D5_GPIO_PIN                                       5U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D5_GPIO_PIN_MASK                          (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_02 (coord G4), SEMC_D2 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D2_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D2_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D2_CHANNEL                                        2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D2_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D2_GPIO_PIN                                       2U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D2_GPIO_PIN_MASK                          (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_06 (coord H4), SEMC_D6 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D6_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D6_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D6_CHANNEL                                        6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D6_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D6_GPIO_PIN                                       6U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D6_GPIO_PIN_MASK                          (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_25 (coord J4), SEMC_RAS */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_RAS_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_RAS_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_RAS_CHANNEL                                      25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_RAS_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_RAS_GPIO_PIN                                     25U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_RAS_GPIO_PIN_MASK                        (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_01 (coord K4), SEMC_D17 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D17_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D17_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D17_CHANNEL                                      11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D17_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D17_GPIO_PIN                                     11U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D17_GPIO_PIN_MASK                        (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_11 (coord L4), SEMC_D26 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D26_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D26_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D26_CHANNEL                                      21U   /*!< Signal channel */

