DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D26_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D26_GPIO_PIN                                     21U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D26_GPIO_PIN_MASK                        (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_14 (coord M4), SEMC_D29 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D29_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D29_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D29_CHANNEL                                      24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D29_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D29_GPIO_PIN                                     24U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D29_GPIO_PIN_MASK                        (1U << 24U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_12 (coord C5), SEMC_A3 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A3_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A3_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A3_CHANNEL                                       12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A3_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A3_GPIO_PIN                                      12U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A3_GPIO_PIN_MASK                         (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_13 (coord D5), SEMC_A4 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A4_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A4_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A4_CHANNEL                                       13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_A4_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_A4_GPIO_PIN                                      13U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_A4_GPIO_PIN_MASK                         (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_28 (coord E5), SEMC_WE */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_WE_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_WE_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_WE_CHANNEL                                       28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_WE_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_WE_GPIO_PIN                                      28U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_WE_GPIO_PIN_MASK                         (1U << 28U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_08 (coord F5), SEMC_DM0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM0_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM0_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM0_CHANNEL                                       8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DM0_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM0_GPIO_PIN                                      8U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DM0_GPIO_PIN_MASK                         (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_27 (coord G5), SEMC_CKE */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CKE_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CKE_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CKE_CHANNEL                                      27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_CKE_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_CKE_GPIO_PIN                                     27U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_CKE_GPIO_PIN_MASK                        (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_04 (coord H5), SEMC_D4 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D4_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D4_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D4_CHANNEL                                        4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D4_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D4_GPIO_PIN                                       4U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D4_GPIO_PIN_MASK                          (1U << 4U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_24 (coord J5), SEMC_CAS */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CAS_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CAS_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CAS_CHANNEL                                      24U   /*!< Signal channel */

