DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_CAS_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_CAS_GPIO_PIN                                     24U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_CAS_GPIO_PIN_MASK                        (1U << 24U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_13 (coord K5), SEMC_D28 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D28_PERIPHERAL                                 GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D28_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D28_CHANNEL                                      23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D28_GPIO                                       GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D28_GPIO_PIN                                     23U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D28_GPIO_PIN_MASK                        (1U << 23U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_29 (coord E6), SEMC_CS0 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CS0_PERIPHERAL                                 GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CS0_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CS0_CHANNEL                                      29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_CS0_GPIO                                       GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_CS0_GPIO_PIN                                     29U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_CS0_GPIO_PIN_MASK                        (1U << 29U)   /*!< GPIO pin mask */

/* PMIC_ON_REQ (coord U9), PMIC_ON_REQ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_ON_REQ_PERIPHERAL                               SNVS   /*!< Peripheral name */
#define BOARD_INITPINS_PMIC_ON_REQ_SIGNAL                    snvs_lp_pmic_on_req   /*!< Signal name */

/* GPIO_AD_03 (coord P15), SIM1_SVEN/J57[2]/Flash_RST/U21[B2]/J25[9]/J10[8] */
/* Routed pin properties */
#define BOARD_INITPINS_FOG_LAMP_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_FOG_LAMP_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_FOG_LAMP_CHANNEL                                       2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FOG_LAMP_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_FOG_LAMP_GPIO_PIN                                      2U   /*!< GPIO pin number */
#define BOARD_INITPINS_FOG_LAMP_GPIO_PIN_MASK                         (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_04 (coord B15), SD1_D2/J15[1]/WIFI_SDIO_D2/J54[17] */
/* Routed pin properties */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_PERIPHERAL           GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_SIGNAL              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_CHANNEL                  7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_GPIO                 GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_GPIO_PIN                 7U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_RETURN_MCU_IN_GPIO_PIN_MASK    (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_01 (coord D15), SD1_CLK/J15[5]/WIFI_SDIO_CLK/J54[9] */
/* Routed pin properties */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_PERIPHERAL             GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_CHANNEL                    4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_GPIO                   GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_GPIO_PIN                   4U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_DOWN_MCU_IN_GPIO_PIN_MASK      (1U << 4U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_05 (coord A16), SD1_D3/J15[2]/WIFI_SDIO_D3/J54[19] */
/* Routed pin properties */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_PERIPHERAL               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_SIGNAL                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_CHANNEL                      8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_GPIO                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_GPIO_PIN                     8U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_HANDLEBAR_SW_UP_MCU_IN_GPIO_PIN_MASK        (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_AD_23 (coord J12), BT_PCM_SYNC */
/* Routed pin properties */
#define BOARD_INITPINS_BT_PCM_SYNC_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_BT_PCM_SYNC_SIGNAL                            gpio_mux_io   /*!< Signal name */
#define BOARD_INITPINS_BT_PCM_SYNC_CHANNEL                                   22U   /*!< Signal channel */

/* GPIO_AD_13 (coord L12), SPDIF_SR_CLK/ANATOP_32K_OUT/J26[8] */
/* Routed pin properties */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_PERIPHERAL                        GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_CHANNEL                             12U   /*!< Signal channel */

