DileepMys/HERO_RAA_2.0V/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_GPIO                              GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_GPIO_PIN                            12U   /*!< GPIO pin number */
#define BOARD_INITPINS_TT_SS_DIG_MCU_OUT_GPIO_PIN_MASK               (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_AD_18 (coord M16), SAI1_RX_SYNC/J9[5]/J50[19]/U32[13] */
/* Routed pin properties */
#define BOARD_INITPINS_AI_SSTT_FDBK_DIAG_PERIPHERAL                       LPADC2   /*!< Peripheral name */
#define BOARD_INITPINS_AI_SSTT_FDBK_DIAG_SIGNAL                                A   /*!< Signal name */
#define BOARD_INITPINS_AI_SSTT_FDBK_DIAG_CHANNEL                              2U   /*!< Signal channel */

/* GPIO_AD_00 (coord N12), SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14] */
/* Routed pin properties */
#define BOARD_INITPINS_Illum_PWM_PERIPHERAL                                 PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_Illum_PWM_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITPINS_Illum_PWM_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_AD_32 (coord K16), ENET_MDC/U7[12]/SD1_CD_B/J15[9] */
/* Routed pin properties */
#define BOARD_INITPINS_BTLE_UART_TX_PERIPHERAL                          LPUART10   /*!< Peripheral name */
#define BOARD_INITPINS_BTLE_UART_TX_SIGNAL                                   TXD   /*!< Signal name */

/* GPIO_AD_33 (coord H17), ENET_MDIO/U7[11] */
/* Routed pin properties */
#define BOARD_INITPINS_BTLE_UART_RX_PERIPHERAL                          LPUART10   /*!< Peripheral name */
#define BOARD_INITPINS_BTLE_UART_RX_SIGNAL                                   RXD   /*!< Signal name */

/* GPIO_LPSR_08 (coord U8), DMIC_CLK/U41[1]/U44[1]/J50[18] */
/* Routed pin properties */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_PERIPHERAL                        GPIO12   /*!< Peripheral name */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_CHANNEL                               8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_GPIO                              GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_GPIO_PIN                              8U   /*!< GPIO pin number */
#define BOARD_INITPINS_DOUT_BTLE_PS_RST_GPIO_PIN_MASK                 (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_AD_17 (coord N15), SAI1_MCLK/U32[11]/J9[15] */
/* Routed pin properties */
#define BOARD_INITPINS_BLE_3P3V_EN_PERIPHERAL                              GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_BLE_3P3V_EN_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BLE_3P3V_EN_CHANNEL                                   16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_3P3V_EN_GPIO                                    GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_3P3V_EN_GPIO_PIN                                  16U   /*!< GPIO pin number */
#define BOARD_INITPINS_BLE_3P3V_EN_GPIO_PIN_MASK                     (1U << 16U)   /*!< GPIO pin mask */

/* GPIO_LPSR_06 (coord P8), I2C6_SDA */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SDA_PERIPHERAL                                LPI2C6   /*!< Peripheral name */
#define BOARD_INITPINS_I2C6_SDA_SIGNAL                                       SDA   /*!< Signal name */

/* GPIO_LPSR_07 (coord R8), I2C6_SCL */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SCL_PERIPHERAL                                LPI2C6   /*!< Peripheral name */
#define BOARD_INITPINS_I2C6_SCL_SIGNAL                                       SCL   /*!< Signal name */

/* GPIO_AD_30 (coord K17), LPSPI1_SDO */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_SDO_PERIPHERAL                                CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_SDO_SIGNAL                                      TX   /*!< Signal name */

/* GPIO_AD_31 (coord J17), LPSPI1_SDI */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_SDI_PERIPHERAL                                CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_SDI_SIGNAL                                      RX   /*!< Signal name */

/* GPIO_AD_29 (coord M17), LPSP1_PCS0 */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_PCS0_PERIPHERAL                              GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_PCS0_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LPSPI1_PCS0_CHANNEL                                   28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LPSPI1_PCS0_GPIO                                    GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LPSPI1_PCS0_GPIO_PIN                                  28U   /*!< GPIO pin number */
#define BOARD_INITPINS_LPSPI1_PCS0_GPIO_PIN_MASK                     (1U << 28U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
